moneypenny/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
      Account.create(debit: true, account_category: 'Cash', institution: 'None', label: 'Greenbacks', balance: 0, user_id: @user.id)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "p_num") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("email", "fname", "lname", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "accounts" ("debit", "account_category", "institution", "label", "balance", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"