app/views/users/show.html.erb

<ul>
<% @user.accounts.each do |a| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", "2"]]

<ul>
<% @user.transactions.each do |t| %>
---
SELECT "transactions".* FROM "transactions" INNER JOIN "accounts" ON "transactions"."account_id" = "accounts"."id" WHERE "accounts"."user_id" = $1 ORDER BY date DESC  [["user_id", "2"]]

<ul>
<% @user.bills.each do |b| %>
---
SELECT "bills".* FROM "bills" WHERE "bills"."user_id" = $1  [["user_id", 1]]

<ul>
<% @user.goals.each do |g| %>
---
SELECT "goals".* FROM "goals" INNER JOIN "accounts" ON "goals"."account_id" = "accounts"."id" WHERE "accounts"."user_id" = $1  [["user_id", "1"]]