moneypenny/app/models/user.rb

  def self.find_by_credentials(em, pw)
    @user = User.find_by(email: em);
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@email.com"], ["LIMIT", 1]]