app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "fname", "lname") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"